{
  "_source": "auto_inference",
  "attr_Product_Form": "Physical form of the onion product after processing.",
  "attr_Mesh_Size": "Sieve aperture range that defines particle fineness of the powder.",
  "attr_Processing_Method": "Primary technological treatment applied to the onion before it becomes powder.",
  "attr_Organic_Status": "Whether the product is certified organic or not.",
  "attr_Origin_Country": "Country where the onion powder was produced or sourced.",
  "attr_Packaging_Type": "Typical commercial packaging format for onion powder shipments.",
  "attr_Grade": "Quality classification used by manufacturers or importers.",
  "attr_Allergen_Status": "Declaration of allergen presence in the product.",
  "attr_FDA_Registration_Number": "US FDA registration identifier associated with the product batch or facility.",
  "attr_Irradiation_Status": "Indicates whether the product has been exposed to ionizing radiation.",
  "attr_Storage_Temperature_Celsius": "Recommended or recorded storage temperature for the product during transit.",
  "attr_Expiry_Date": "Year in which the product is expected to reach the end of its shelf life.",
  "attr_Net_Weight_Per_Package": "Net weight of onion granules contained in a single package.",
  "attr_Irradiated_Status": "Indicates if the granulated onion has undergone ionizing radiation treatment.",
  "attr_Product_Use": "Typical end‑use application of the granulated onion in food manufacturing.",
  "attr_Treatment_Type": "Additional processing or post‑treatment applied to the granules.",
  "attr_Color": "Visual color of the finished onion powder.",
  "attr_Form": "Physical shape or texture of the onion product after processing.",
  "attr_Particle_Size_Range": "Typical mesh or millimeter size range of the product particles.",
  "attr_Certification": "Official food safety or organic certifications attached to the product.",
  "attr_Shelf_Life": "Typical period from manufacture to expiry under normal storage conditions.",
  "attr_Use_Type": "Intended end‑use of the onion powder in the supply chain.",
  "attr_Net_Weight_Per_Package_Kg": "Net weight of a single packaged unit expressed in kilograms.",
  "attr_Expiration_Year_Range": "Typical shelf‑life window indicated on product labeling.",
  "attr_Physical_Form": "Descriptive physical state of the product after processing.",
  "attr_Moisture_Content": "Relative moisture level of the product, influencing stability."
}